{"data":{"site":{"siteMetadata":{"title":"Веб-стандарты"}},"markdownRemark":{"id":"d87cf865-f005-50c6-8af3-a09017f16984","excerpt":"Прогрессивное улучшение меня расстраивает Перевод «Progressive Enhancement Makes Me Sad» Хейдона Пикеринга. Последнее время только и…","html":"<h1>Прогрессивное улучшение меня расстраивает</h1>\n<p>Перевод «Progressive Enhancement Makes Me Sad» Хейдона Пикеринга.</p>\n<p>Последнее время только и разговоров в защиту прогрессивного улучшения и «универсальных» (изоморфных) приложений. Оказывается, серверный рендеринг улучшает быстродействие, надёжность, совместимость и упрощает парсинг содержимого.</p>\n<p>Я поддерживаю эти аргументы из душевной щедрости.</p>\n<p>Но есть и глубокая озабоченность, связанная с применением прогрессивного улучшения и изоморфизма, о которой стоит поговорить. И похоже только у меня хватит смелости, чтобы пойти против толпы. Не благодарите.</p>\n<h3>1. Это сложно :(</h3>\n<p>Создавать приложения, которые либо рендерят статическое содержимое и потом улучшают его с помощью <em>JavaScript</em>, либо работают как приложения сразу на сервере и клиенте — это очень, очень сложно. Типа <em>очень</em>.</p>\n<p>Нет, конечно, это значит, что больше пользователей получит доступ к содержимому быстрее и надёжнее — с этим я не спорю. Но кто сказал, что вообще <em>будут</em> какие-то пользователи? Или какое-то <em>содержимое</em>, если уж на то пошло. Половина проектов, над которыми я работаю, уходят в стол из-за реорганизаций компании. В чём смысл тратить всё это дополнительное время на сложности прогрессивного улучшения? Да не глупите.</p>\n<p>Но это даже не самая главная проблема. Главная проблема в том, что моя идентичность построена вокруг интеллектуальной компетенции. Это значит, что, когда встречаюсь с интеллектуальной сложностью, я довольно быстро теряю эту самую компетенцию.</p>\n<p>Поэтому, прежде чем приступать к архитектуре универсального приложения, спросите себя: «Правда ли мне нужно, чтобы кто-то в страшном когнитивном диссонансе взбесился на меня?»</p>\n<p>Думаю нет. <em>(Это будто бы звучит как угроза, гы-гы. Сорьки, лол.)</em></p>\n<h3>2. Мне это не нужно</h3>\n<p>Прогрессивное улучшение делает жизнь пользователей легче в некоторых ситуациях, вроде медленных сетей, слабых устройств и т.п. — это правда. Не поймите меня неправильно, я двумя руками за то, чтобы создавать приложения для пользователей, но не забыли ли мы о ком-то ещё? Раз уж я создал чёртово приложение, разве у меня нет права голоса в том, как оно создано?</p>\n<p>Конечные пользователи — это такое неизвестное множество, и мы мало что можем с этим сделать. С другой стороны, я уже знаю много чего о <em>себе</em> потому, что я — <em>это я</em>. Мне стоит пользоваться всеми преимуществами такой инсайдерской информации.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/1*yV_qZBOF9830yr8CbtHIzQ.png\" alt=\"Целевой рынок или «верхушка колокола»\"><em>Целевой рынок или «верхушка колокола»</em></p>\n<p>И что же я знаю о себе? Ну, для начала, у меня вполне неплохое окружение: оптика, 16 Гб оперативки. А ещё я не выношу работы с прогрессивным улучшением, <strong>фу, гадость</strong>. (См. пункт №1).</p>\n<p>Хотя больше всего я люблю делать новые фичи. Чем меньше времени мне придётся потратить на стабильную архитектуру (скукота), тем больше времени останется на создание фич. Знаете, как говорят: <strong>больше фич — лучше экспириенс!</strong> Все в выигрыше.</p>\n<h3>3. Это провоцирует плохое поведение</h3>\n<p>И если мы лезем вон из кожи (а это действительно заставляет вас лезть из кожи) чтобы убедиться, что содержимое дойдёт слабеньких устройств с крошечными лимитами трафика на дерьмовеньких сетях, мы просто даём аудитории отговорку, чтобы не обновляться.</p>\n<p>Я хочу, чтобы ты был лучше, насколько это возможно!</p>\n<p>Ну и поезда. То есть у вас проблемы с тем, чтобы загрузить срендеренную на клиенте блокирующе-зависимую от скриптов страничку по <em>2G</em> потому, что вы в поезде? Решение прямо у вас под носом: <strong>хватит ездить на поезде.</strong> Либо найдите себе комнату в центре города рядом с работой, либо спите под столом. Я так и сделал, почему вы не сможете?</p>\n<p>Ну правда, примите уже ответственность.</p>\n<h3>4. Кругом только веб-приложения</h3>\n<p>Веб изначально был рождён для публикации и распространения текстов в целях приобретения и утверждения знания. К счастью, эти тёмные и примитивные годы остались позади нас и мы перешли к лучшим вещам, вроде создания приложений, которые смотрят на фотографии собак и пытаются определить их возраст.</p>\n<p>Нет никакого «документа» в основе приложения, которое определяет возраст вашей собаки. Ну, то есть, как бы он вообще выглядел? Картинка чьей-то собаки с подписью «Я не знаю сколько мне лет, извините» под ней? Это убого. Я бы скорее предпочёл не увидеть вообще ничего, если уж начистоту.</p>\n<p>Нет, если вы не хотите знать, что думает ваш браузер о возрасте вашей собаки, пожалуйста — выключите <em>JavaScript</em> или прокатитесь на поезде (см. пункт №3). Вы всё равно не заслуживаете знать, сколько лет вашей собаке.</p>\n<p>Но потом не приходите ко мне в слезах, когда кто-нибудь рядом спросит сколько лет вашей собаке, и вам придётся сказать «Я не знаю, где-то между 5 и 8, наверное» вместо «Я не знал, но кто-то запостил это довольно забавное веб-приложение на Фейсбуке. Давайте покажу. Минутку. Вот оно. Секунду. Извините. Сейчас. А, ладно, проехали».</p>\n<p><em>Перевод «<a href=\"http://www.heydonworks.com/article/progressive-enhancement-makes-me-sad\">Progressive Enhancement Makes Me Sad</a>» Хейдона Пикеринга, в ответ на «<a href=\"http://jamesknelson.com/universal-react-youre-doing-it-wrong/\">Universal React: You’re doing it wrong</a>». Опубликовано с разрешения автора. Перевод и редактура <a href=\"https://medium.com/@pepelsbey\">Вадима Макеева</a>.</em></p>","frontmatter":{"title":"Прогрессивное улучшение меня расстраивает","date":"TODO"}}},"pageContext":{"slug":"/articles/pe-makes-me-sad/"}}