{"data":{"site":{"siteMetadata":{"title":"Веб-стандарты"}},"markdownRemark":{"id":"2c15dfd6-e5dd-5bc3-8250-59472ed2117f","excerpt":"Манифест? А? Что? Зачем? Перевод поясняющей заметки к спецификации Web App Manifest. Многие из нас , кто работает над вебом, активно…","html":"<h1>Манифест? А? Что? Зачем?</h1>\n<p>Перевод поясняющей заметки к спецификации Web App Manifest.</p>\n<p><a href=\"https://github.com/w3c/manifest/graphs/contributors\">Многие из нас</a>, кто работает над вебом, активно стараются уменьшить разрыв между нативными и веб-приложениями.</p>\n<p>Но что это за разрыв? Всего несколько лет назад этот разрыв был, в большей степени, технологическим. Если вы хотели получить доступ к <em>GPS</em> устройства, вам приходилось писать нативное приложение. Сейчас ситуация несколько улучшилась: теперь мы можем получать доступ к датчикам устройства, вроде <em>GPS</em>, камеры и ориентации устройства — хотя впереди ещё долгий путь. Благодаря последним успехам веб-технологий, теперь у нас есть платформа, которая может конкурировать с нативными приложениями уже почти на равных.</p>\n<p>Сегодня разрыв между нативными и веб-приложениями не столько технологический — дело в удобстве пользователей: они предпочитают устанавливать приложения, которые уютно живут на домашнем экране (или даже на рабочем столе, если речь про десктопные браузеры).</p>\n<p>Кроме того, нативные приложения по умолчанию работают в офлайне и интегрируются с возможностями, которые предоставляет операционная система: например, возможность видеть установленные приложения в переключателе задач. Или возможность управлять настройками конфиденциальности приложения в том же самом месте, что и для приложений, установленных из магазина. Чтобы сделать что-нибудь подобное в браузере, мы всё ещё слоняемся по браузеру в поисках открытых вкладок и вводим длинные, скучные адреса.</p>\n<p>Нам нужен такой способ «установки» веб-приложений, чтобы они были неотличимы от любого другого приложения, установленного на устройстве пользователя. Но в тоже время, мы не хотим потерять мощные функции, составляющие основу веб-платформы: связанность ссылками, просмотр исходного кода и возможность хостить собственные проекты.</p>\n<p>Мы в веб-сообществе, как правило, называем это «<a href=\"https://en.wikipedia.org/wiki/Progressive_web_app\">прогрессивными веб-приложениями</a>».</p>\n<h2>Что такое «установка»?</h2>\n<p>По сути, «установка» веб-приложения — это добавление «закладки» на домашний экран или в программу запуска приложений. Есть некоторые довольно очевидные вещи, которые вы, как разработчик, должны предоставить браузеру, чтобы тот мог считать сайт приложением: название, иконки, и т.д. Есть и более сложные функции, которые могут вам пригодиться, например, возможность указать предпочтительную ориентацию устройства и нужен ли вам полноэкранный режим.</p>\n<p>Спецификация манифеста предлагает вам стандартный способ сделать это с помощью файла <em>JSON</em>. Просто сошлитесь на файл манифеста в <em>HTML</em>-странице следующим образом:</p>\n<pre><code>&#x3C;link rel=\"manifest\" href=\"/manifest.json\">\n</code></pre>\n<p>Но что находится в этом загадочном файле манифеста? Хорошо, что вы спросили!</p>\n<h2>Очень простой манифест</h2>\n<p>Самый простой манифест может состоять всего-то из имени и одной или нескольких иконок.</p>\n<pre><code>{\n    \"name\": \"Супергонщик 3000\",\n    \"icons\": [{\n        \"src\": \"icon/lowres.png\",\n        \"sizes\": \"64x64\"\n    }]\n}\n</code></pre>\n<h2>Типичный манифест</h2>\n<p>Более типичный манифест может выглядеть следующим образом. Имена его ключей должны говорить сами за себя, но мы подробнее опишем их использование ниже.</p>\n<pre><code>{\n    \"lang\": \"ru\",\n    \"dir\": \"ltr\",\n    \"name\": \"Супергонщик 3000\",\n    \"description\": \"Потрясающая футуристичная гоночная игра из будущего!\",\n    \"short_name\": \"Гонщик3K\",\n    \"icons\": [{\n        \"src\": \"icon/lowres.webp\",\n        \"sizes\": \"64x64\",\n        \"type\": \"image/webp\"\n    },{\n        \"src\": \"icon/lowres.png\",\n        \"sizes\": \"64x64\"\n    }, {\n        \"src\": \"icon/hd_hi\",\n        \"sizes\": \"128x128\"\n    }],\n    \"scope\": \"/racer/\",\n    \"start_url\": \"/racer/start.html\",\n    \"display\": \"fullscreen\",\n    \"orientation\": \"landscape\",\n    \"theme_color\": \"aliceblue\",\n    \"background_color\": \"red\",\n    \"screenshots\": [{\n        \"src\": \"screenshots/in-game-1x.jpg\",\n        \"sizes\": \"640x480\",\n        \"type\": \"image/jpeg\"\n    },{\n        \"src\": \"screenshots/in-game-2x.jpg\",\n        \"sizes\": \"1280x920\",\n        \"type\": \"image/jpeg\"\n    }]\n}\n</code></pre>\n<h2>Название приложения</h2>\n<p>Приложению нужно настоящее название или набор названий (которые обычно совсем не совпадают с содержимым элемента <title> документа). Для этого используются ключи name и short_name.</p>\n<pre><code>{\n    \"name\": \"Моё вообще улётное фотоприложение\",\n    \"short_name\": \"Фотки\"\n}\n</code></pre>\n<p>Ключ short_name служит названием приложения при отображении в условиях ограниченного пространства (например, под значком на домашнем экране телефона). Ключ name может быть немного длиннее, отображая название приложения полностью. Также он служит дополнительной информацией для пользователя, который ищет ваше приложения на телефоне. Так что, набрав «улётный» или «фото», пользователь сможет найти приложение на своем устройстве.</p>\n<p>Если вы опустите название, то браузер может использовать <meta name=\"application-name\"> или элемент <title>.</p>\n<p>Но будьте внимательны: некоторые браузеры могут требовать указать название — иначе, ваше приложение может лишиться статуса «прогрессивное веб-приложение».</p>\n<h2>Иконки</h2>\n<p>Вместо обычной иконки браузера, у вашего веб-приложения должна быть иконка, которая будет с ним ассоциироваться. Для этого в манифесте есть ключ icons. Он принимает список иконок, их размеров и форматов. Это делает процесс выбора иконки очень эффективным, поскольку у иконок появляется адаптивное решение, которое позволяет избежать ненужных нагрузок и помогает иконкам всегда выглядеть отлично на широком диапазоне устройств и разрешений экрана.</p>\n<pre><code>{\n    \"icons\": [{\n        \"src\": \"icon/lowres\",\n        \"sizes\": \"64x64\",\n        \"type\": \"image/webp\"\n    }, {\n        \"src\": \"icon/hd_small\",\n        \"sizes\": \"64x64\"\n    }, {\n        \"src\": \"icon/hd_hi\",\n        \"sizes\": \"128x128\",\n    }]\n}\n</code></pre>\n<p>Если вы не укажете иконки, браузер будет искать запасные варианты: <link rel=\"icon\">, <em>favicon.ico</em> или, если не найдёт их, может даже использовать скриншот вашего сайта.</p>\n<h2>Назначение иконки</h2>\n<p>Нужно написать.</p>\n<p>Больше подробностей о назначении иконок можно найти в спецификации <a href=\"http://www.w3.org/TR/appmanifest/#purpose-member\">*Web App Manifest</a>*.</p>\n<h2>Режимы отображения и ориентация</h2>\n<p>Приложения при запуске должны иметь возможность контролировать свое отображение на экране. Если это игра, то ей, вероятно, нужно быть в полноэкранном режиме и в горизонтальной ориентации. Для этого формат манифеста предоставляет вам два ключа.</p>\n<pre><code>{\n    \"display\": \"fullscreen\",\n    \"orientation\": \"landscape\"\n}\n</code></pre>\n<p>Доступные значения режимов отображения:</p>\n<ul>\n<li>\n<p><strong>Полноэкранный</strong> fullscreenзанимает весь экран.</p>\n</li>\n<li>\n<p><strong>Автономный</strong> standalone открывает приложение со строкой состояния.</p>\n</li>\n<li>\n<p><strong>Минимальный</strong> minimal-ui, когда приложение отображается в полноэкранном режиме, как на <em>iOS</em>, но некоторые действия могут вызывать панель навигации и появление кнопок назад и вперед.</p>\n</li>\n<li>\n<p><strong>Браузерный</strong> browser открывает приложение со стандартным набором кнопок и панелью инструментов.</p>\n</li>\n</ul>\n<p>Плюс такого указания ориентации в том, что она выступает в качестве «ориентации по умолчанию» для всего приложения. Поэтому, при переходе от одной странице к другой, ваше приложение остается в правильном положении. Вы можете изменить ориентацию по умолчанию с помощью <a href=\"https://w3c.github.io/screen-orientation/\"><em>API</em> ориентации экрана</a>.</p>\n<p>Также вы можете применить другие стили для приложение в определённом режиме с помощью характеристики display-mode:</p>\n<pre><code>[@media](http://twitter.com/media) all and (display-mode: standalone) {\n    /* … */\n}\n</code></pre>\n<p>Используйте метод window.matchMedia(), чтобы проверить это медиавыражение в <em>JavaScript</em>.</p>\n<pre><code>if (window.matchMedia('(display-mode: standalone)').matches) {\n    // интересные модификации интерфейса\n}\n</code></pre>\n<h2>Стартовый адрес</h2>\n<p>Иногда при запуске приложения вам нужно, чтобы пользователь всегда попадал на определенную страницу. Ключ start_url даёт возможность это указать.</p>\n<pre><code>{\n    \"start_url\": \"/start_screen.html\"\n}\n</code></pre>\n<h2>«Область» приложения</h2>\n<p>Нативные приложения имеют чёткие границы: как пользователь, вы уверены, что когда вы открываете нативное приложение, оно неожиданно не откроет другое незаметно для вас. Чаще всего, вам предельно ясно, что вы переключились с одного нативного приложения на другое. Обычно эти визуальные подсказки предоставляет операционная система (например, вызов диспетчера задач и выбор другого приложения или нажатие <em>Cmd Tab</em> или <em>Alt Tab</em> на компьютере).</p>\n<p>С вебом все иначе: это огромная гипертекстовая система, в которой веб-приложение может охватывать несколько доменов: вы можете с легкостью перейти с <em>gmail.com</em> на <em>docs.google.com</em> и пользователь даже этого не заметит. На практике, идея существования границ приложения является абсолютно чуждой для веба. Ведь, в действительности, веб-приложение — это просто серия <em>HTML</em>-документов (представьте «серию труб»… м-м, нет, забудьте!).</p>\n<p>В интернете мы знаем, что покидаем область одного приложения и переходим в другое, только благодаря веб-дизайнерам, которые были достаточно добры, чтобы сделать им уникальный различимый дизайн. В случаях, когда это не так, множество пользователей оказываются обмануты сайтами, маскирующимися под другие (старый добрый фишинг).</p>\n<p>Формат манифеста решает эту проблему позволяя указывать «область адреса» для вашего приложения. Эта область устанавливает границы для приложения. Это может быть либо домен, либо директория на этом домене.</p>\n<pre><code>{\n    \"scope\": \"/myapp\"\n}\n</code></pre>\n<h2>Интернационализация: lang и dir</h2>\n<p>Нужно написать.</p>\n<h2>Распространение приложения</h2>\n<p>Нужно написать с подробностями и скриншотами.</p>\n<h2>Цвет темы и цвет фона</h2>\n<p>Нужно написать.</p>\n<h2>Как мне определить, что пользователь «установил» приложение?</h2>\n<p>Спецификация позволяет вам определить, когда пользователь устанавливает приложение с помощью регистрации события appinstalled.</p>\n<pre><code>function handleInstalled(ev) {\n    const date = new Date(ev.timeStamp / 1000);\n    console.log(`Ура! Установлено в ${date.toTimeString()}`);\n}\n\n// Используем атрибут IDL обработчика события\nwindow.onappinstalled = handleInstalled;\n\n// Используем .addEventListener()\nwindow.addEventListener('appinstalled', handleInstalled);\n</code></pre>\n<p>Однако по причинам конфиденциальности вы не можете непосредственно обнаружить, установлено ли ваше приложение — только узнать, что в вашем веб-приложении используется файл манифеста.</p>\n<h2>Что не так с тегами <meta>?</h2>\n<p>В ходе обсуждения спецификации шли оживленные дискуссии об использовании тегов <meta> в <em>HTML</em> вместо создания нового формата. В конце концов, реализация функции «добавить на домашний экран» в <em>Chrome</em> использует теги <meta>, да и с самых первых дней веба эти теги были родным домом для всякой нестандартной ерунды.</p>\n<p>Причины для использования отдельного файла:</p>\n<ul>\n<li>\n<p>это экономит кучу информации в шапке документа при загрузке каждой страницы установленного приложения или сайта;</p>\n</li>\n<li>\n<p>после загрузки, файл остаётся в <em>HTTP</em>-кэше браузера.</p>\n</li>\n</ul>\n<p>В спецификации есть <a href=\"https://www.w3.org/TR/appmanifest/#relationship-to-html-s-link-and-meta-elements\">более подробная информация</a> о том, почему мы выбрали <em>JSON</em> вместо <em>HTML</em>-тегов.</p>\n<h2>Кто это внедряет?</h2>\n<p>Манифест и прогрессивные веб-приложения реализованы в <em>Chrome</em>, <em>Opera</em> и <em>Samsung Internet</em> для <em>Android</em>. <em>Firefox</em> также подаёт обнадёживающие сигналы, что будет поддерживать эти стандарты (реализации в <em>Gecko</em> уже больше двух лет, но она не используется ни в одном из продуктов).</p>\n<h2>Взаимодействие с поисковыми роботами</h2>\n<p>Как и другие веб-ресурсы, манифест веб-приложения должен быть доступен для любого веб-браузера или поискового робота.</p>\n<p>Если разработчик веб-приложения хочет известить поисковых роботов о запрете на сканирование файла, он <strong>может</strong> сделать это включив манифест веб-приложения в файл <em>robots.txt</em>. Это описано подробнее в протоколе <a href=\"http://www.robotstxt.org/\">*robots.txt</a><em>. Разработчик веб-приложения также может использовать *HTTP</em>-заголовок <em>X-Robots-Tag</em>.</p>\n<h2>Авторы</h2>\n<p>Основная часть этого пояснения первоначально появилась в статье «<a href=\"http://html5doctor.com/web-manifest-specification/\">*The W3C App Manifest specification</a><em>» на [</em>HTML5 Doctor](<a href=\"http://html5doctor.com/\">http://html5doctor.com/</a>)*, и была написана <a href=\"https://github.com/marcoscaceres\">Маркусом Касересом</a> и <a href=\"http://www.brucelawson.co.uk/\">Брюсом Лоусоном</a>. Данный материал публикуется на основе лицензии <a href=\"http://creativecommons.org/licenses/by-nc/2.0/uk/\">для некоммерческое использования</a>. Вы можете спокойно изменять, повторно использовать, модифицировать и расширять это пояснение. Некоторые авторы сохраняют свои авторские права на отдельные статьи.</p>\n<p><em>Перевод <a href=\"https://github.com/w3c/manifest/blob/gh-pages/explainer.md\">поясняющей заметки</a> к спецификации <a href=\"https://www.w3.org/TR/appmanifest/\">Web App Manifest</a>. Перевод <a href=\"https://medium.com/@annakukhareva\">Анны Кухаревой</a> и <a href=\"https://medium.com/@pepelsbey\">Вадима Макеева</a>, редактура Вадима Макеева.</em></p>","frontmatter":{"title":"Манифест? А? Что? Зачем?","date":"TODO"}}},"pageContext":{"slug":"/articles/manifest-what-why/"}}