{"data":{"site":{"siteMetadata":{"title":"Веб-стандарты"}},"markdownRemark":{"id":"f055435f-03ff-5351-ac8f-87f6707559f5","excerpt":"Глубокое погружение в ES-модули в картинках Перевод «ES modules: A cartoon deep-dive» Лин Кларк. ES -модули приносят в  JavaScript…","html":"<h1>Глубокое погружение в ES-модули в картинках</h1>\n<p>Перевод «ES modules: A cartoon deep-dive» Лин Кларк.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2400/1*yl5PHa3rt2ew4HVqVEwRjA.png\"></p>\n<p><em>ES</em>-модули приносят в <em>JavaScript</em> официальную, унифицированную модульную систему. Однако, чтобы прийти к этому, потребовалось почти 10 лет работы по стандартизации.</p>\n<p>Но ожидание почти закончилось. С выходом <em>Firefox 60</em> в мае (пока в бете) все основные браузеры будут поддерживать <em>ES</em>-модули, а Рабочая группа <em>Node Modules</em> сейчас работает над добавлением поддержки <em>ES</em>-модулей в <em>Node.js</em>. Также идет интеграция <em>ES</em>-модулей в <em>WebAssembly</em>.</p>\n<p>Многие <em>JavaScript</em>-разработчики знают, что <em>ES</em>-модули были противоречивыми. Но мало кто действительно понимает, как они работают. Давайте рассмотрим, какую проблему решают <em>ES</em>-модули и чем они отличаются от модулей в других модульных системах.</p>\n<h2>Какую проблему решают модули?</h2>\n<p>Написание кода на <em>JavaScript</em> состоит в работе с переменными — в присвоении значений переменным или добавлении чисел в переменные или объединении двух переменных вместе и помещении их в другую переменную.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*UD4gTeUXaejaQwBx.png\"></p>\n<p>Поскольку большая часть вашего кода связана с изменением переменных, то их организация будет напрямую влиять на качество вашего кода… и на то, насколько хорошо вы сможете поддерживать его в дальнейшем.</p>\n<p>Небольшое количества переменных, о которых вам нужно думать, значительно упростило бы ситуацию. У <em>JavaScript</em> есть способ помочь вам в этом — область видимости <em>(scope)</em>. Из-за того, как области видимости работают в <em>JavaScript</em>, функции не могут обращаться к переменным, определенным в других функциях.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*S8Otp1D1ENByNbs0.png\"></p>\n<p>Это хорошо. Значит когда вы работаете над одной функцией, вы можете сосредоточиться только на ней. Вам не нужно беспокоиться о том, что другие функции могут делать с вашими переменными.</p>\n<p>Однако у такого подхода есть и недостаток. Он затрудняет обмен переменными между различными функциями.</p>\n<p>Что делать, если вы захотите использовать переменную вне текущей области видимости? Обычно способ справиться с этим заключается в том, чтобы положить её в область выше, например, в глобальную область видимости.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*K3tvgoP61czfaTmT.png\"></p>\n<p>Это работает, но появляются некоторые проблемы.</p>\n<p>Во-первых, все ваши скрипты должны быть расположены в определенном порядке. И вы должны будете внимательно следить за тем, чтобы никто не испортил этот порядок.</p>\n<p>Если этот порядок нарушится, то в середине работы ваше приложение выдаст ошибку. Когда функция ищет <em>jQuery</em> там, где она ожидает его — на глобальном уровне — и не находит его, она выбрасывает ошибку и прекращает выполнение.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*eUgkBh7r2VqilmzI.png\"></p>\n<p>Это делает поддержку кода сложным, а удаление старого кода или скриптов игрой в рулетку. Вы не знаете, что может сломаться. Зависимости между этими различными частями кода неявны. Любая функция может использовать что угодно на глобальном уровне, поэтому вы точно не можете знать, какие функции от чего зависят.</p>\n<p>Вторая проблема заключается в том, что поскольку эти переменные находятся в глобальной области видимости, каждая часть кода, находящаяся внутри этой области, может изменить переменную. Вредоносный код может изменить эту переменную специально с целью изменения работы функций или другой код может случайно удалить вашу переменную.</p>\n<h2>Как нам помогут модули?</h2>\n<p>Модули дают вам лучший способ организовать эти переменные и функции. С модулями вы группируете переменные и функции, которые имеет смысл объединить.</p>\n<p>Это помещает эти функции и переменные в область видимости модуля. Область модуля может использоваться для обмена переменными между функциями в модуле.</p>\n<p>Но в отличие от областей видимости функций, области модулей позволяют сделать их переменные доступными и для других модулей. Они могут явно указать, какие переменные, классы или функции в модуле должны быть доступны.</p>\n<p>Когда что-то становится доступным для других модулей, это называется export. После экспорта другие модули могут явно сказать, что они зависят от этой переменной, класса или функции.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*z3bsaQj547DC8tSm.png\"></p>\n<p>Поскольку экспорт указывается явно, это позволяет определить, какие модули будут нарушены при удалении другого.</p>\n<p>Когда у вас появляется возможность экспортировать и импортировать переменные между модулями, это значительно облегчает разбиение вашего кода на небольшие куски, которые могут работать независимо друг от друга. Затем вы можете комбинировать и рекомбинировать эти куски, вроде блоков <em>Lego</em>, для создания любых приложений из одного и того же набора модулей.</p>\n<p>Поскольку модули настолько полезны, было несколько попыток добавить модульность в <em>JavaScript</em>. Сегодня активно используются две системы</p>\n<ol>\n<li>\n<p><em>CommonJS (CJS)</em> — это то, что <em>Node.js</em> использовал изначально.</p>\n</li>\n<li>\n<p><em>ESM</em> (модули <em>ECMAScript</em>) — это более новая система, добавленная в спецификацию <em>JavaScript</em>. Браузеры уже поддерживают <em>ES</em>-модули, а <em>Node.js</em> добавляет поддержку.</p>\n</li>\n</ol>\n<p>Давайте подробно рассмотрим, как работает эта новая модульная система.</p>\n<h2>Как работают <em>ES</em>-модули</h2>\n<p>При разработке с помощью модулей, вы строите граф зависимостей. Связи между различными зависимостями берутся из любых инструкций import, которые вы используете.</p>\n<p>Эти операторы импорта определяют, какой код браузеру или <em>Node.js</em> нужно загрузить. Вы даете ему файл для использования в качестве точки входа в граф. Оттуда он просто следует за любым из операторов импорта, чтобы найти остальную часть кода.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*wx7IkCi21DVWKooZ.png\"></p>\n<p>Но сами файлы не являются тем, что браузер может использовать. Ему необходимо разобрать все эти файлы, чтобы превратить их в структуры данных, называемые записями модулей <em>(module records)</em>. Таким образом, он действительно узнает, что происходит в файле.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*e858f2LgzPRB05ff.png\"></p>\n<p>После этого запись модуля необходимо превратить в экземпляр модуля. Экземпляр объединяет две вещи: код и состояние.</p>\n<p>Код обычно представляет собой набор инструкций. Это как рецепт, как сделать что-то. Но вы не можете просто использовать этот код. Вам нужны исходные материалы для использования с этими инструкциями.</p>\n<p>Что такое состояние? Состояние дает вам эти исходные материалы. Состояние — это фактические значения переменных в любой момент времени. Конечно, эти переменные — это просто псевдонимы для ячеек памяти, которые содержат значения.</p>\n<p>Таким образом, экземпляр модуля объединяет код (список инструкций) с состоянием (значениями всех переменных).</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*4GAPJD0pqkZQ2sLL.png\"></p>\n<p>Нам нужен экземпляр для каждого модуля. Процесс загрузки модуля происходит от файла точки входа к полному графу экземпляров модуля.</p>\n<p>Для <em>ES</em>-модулей это происходит в три этапа.</p>\n<ol>\n<li>\n<p>Построение <em>(constuction)</em> — поиск, загрузка и парсинг всех файлов в записях модулей.</p>\n</li>\n<li>\n<p>Создание экземпляра <em>(instantiation)</em> — поиск ячеек в памяти для размещения всех экспортируемых значений (но пока без заполнения их значениями) Затем связывание — экспорт и импорт этих полей в памяти.</p>\n</li>\n<li>\n<p>Оценка <em>(evaluation)</em>— запуск кода для заполнения этих полей фактическими значениями переменных.</p>\n</li>\n</ol>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*0Dd6MLcpTAjykhRN.png\"></p>\n<p>Люди говорят о том, что ES-модули являются асинхронными. Вы можете думать об этом как о асинхронном процессе, т.к работа делится на три разные фазы:</p>\n<ol>\n<li>\n<p>Построение</p>\n</li>\n<li>\n<p>Создание экземпляров</p>\n</li>\n<li>\n<p>Оценка</p>\n</li>\n</ol>\n<p>Все эти этапы могут выполняться отдельно. Это означает, что спецификация вводит какую-то асинхронность, которой не было в <em>CommonJS</em>. Я объясню это позже, но в <em>CJS</em>-модуль и его зависимости загружаются, создаются и анализируются сразу, без каких-либо перерывов.</p>\n<p>Однако сами по себе действия не обязательно являются асинхронными. Они могут быть выполнены синхронным способом — зависит от того, что делает загрузка. Это потому, что не все контролируется спецификацией <em>ESM</em>. На самом деле есть два этапа работы, которые покрываются различными спецификациями.</p>\n<p>Спецификация <em>ES</em>-модулей говорит о том, как следует анализировать файлы в записях модулей, и как следует создавать экземпляры и оценивать этот модуль. Тем не менее, в спецификации не описывается, как изначально получить эти файлы.</p>\n<p>Это загрузчик, который извлекает файлы. И загрузчик указан в другой спецификации. Для браузеров он описан спецификацией <em>HTML</em>. Но у вас могут быть разные загрузчики, основанные на той платформе, которую вы используете.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*fPQcyIHWjQg1W_IK.png\"></p>\n<p>Загрузчик также точно контролирует загрузку модулей. Он вызывает методы <em>ES</em>-модуля: <em>ParseModule</em>, <em>Module.Instantiate</em> и <em>Module.Evaluate</em>.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/NaN/0*gSiKMh4nSOaPPM57.png\"></p>\n<p>Теперь давайте пройдемся по каждому шагу более подробно.</p>\n<h3>Построение (Construction)</h3>\n<p>Во время этапа построения для каждого модуля происходят три вещи:</p>\n<ol>\n<li>\n<p>Определение, где загрузить файл, содержащий модуль <em>(module resolution)</em>.</p>\n</li>\n<li>\n<p>Загрузка файла (по <em>URL</em> или из файловой системы).</p>\n</li>\n<li>\n<p>Синтаксический анализ файла в записи модуля.</p>\n</li>\n</ol>\n<h3>Поиск и получение файла (fetching)</h3>\n<p>Загрузчик позаботится о поиске файла и его загрузке. Сначала ему необходимо найти файл точки входа. В <em>HTML</em> вы указываете загрузчику, где его найти, используя тег <script>.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*WzWUDhsp3ZQwuRhS.png\"></p>\n<p>Но как он найдет следующую группу модулей — от которых напрямую зависят модули main.js?</p>\n<p>В этом случае используются операторы import. Одна часть оператора импорта называется спецификатором модуля. Он сообщает загрузчику, где он может найти каждый следующий модуль.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*OMTl_f284KMAm5QJ.png\"></p>\n<p>Одно замечание о спецификаторах модулей: иногда их нужно обрабатывать по-разному в браузере и <em>Node.js</em>. Каждый хост имеет свой собственный способ интерпретации спецификатора модуля. Для этого он использует решение, называемое алгоритмом разрешения модулей, которое отличается между платформами. В настоящее время некоторые спецификаторы модулей, которые работают в <em>Node.js</em>, не будут работать в браузере, но сейчас ведутся <a href=\"https://github.com/domenic/package-name-maps\">работы по устранению этой проблемы</a>.</p>\n<p>Пока это не исправлено, браузеры принимают только <em>URL</em> в качестве спецификаторов модуля. Они загружают файл модуля с этого <em>URL</em>. Но это не происходит для всего графа одновременно. Вы не знаете, какие зависимости модуль должен получить, пока вы не проанализировали файл… и вы не сможете проанализировать файл, пока не получите его.</p>\n<p>Это означает, что мы должны пройти через дерево поэтапно, слой за слоем, анализировать один файл, выяснить его зависимости, а затем найти и загрузить их.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*z6YBWuNyRERpNk9a.png\"></p>\n<p>Если бы основной поток ожидал загрузки каждого из этих файлов, в его очереди скопилось бы много других задач. Это потому, что, когда вы работаете в браузере, загрузка занимает большую часть времени.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*OeKzBEFkWO-2XM91.png\"></p>\n<p>Блокировка основного потока сделает использование модулей в вашем приложении очень медленным. Это одна из причин того, что спецификация <em>ES</em>-модулей разбивает алгоритм на несколько этапов. Разбиение на фазы позволяет браузерам извлекать файлы и строить свое понимание графа модуля перед тем, как приступить к синхронной работе по созданию экземпляров.</p>\n<p>Этот подход — разделение алгоритма на фазы — является одним из ключевых различий между <em>ES</em>-модулями и модулями <em>CommonJS</em>.</p>\n<p><em>CommonJS</em> может делать всё по-другому, потому что загрузка файлов из файловой системы занимает гораздо меньше времени, чем загрузка через интернет. Это означает, что <em>Node.js</em> может блокировать основной поток при загрузке файла. И раз файл уже загружен, есть смысл сразу провести построение <em>(construction)</em> и создание экземпляров (без разбивки на фазы). Это также означает, что вы идёте по всему графу, загружаете, создаете экземпляры и оцениваете зависимости перед возвратом экземпляра модуля.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*-aK0BYiBf7vbr-04.png\"></p>\n<p>Подход <em>CommonJS</em> имеет несколько последствий, и я расскажу об этом позже. Но одно это означает, что в <em>Node.js</em> с модулями <em>CommonJS</em> вы можете использовать переменные в вашем спецификаторе модуля. Вы выполняете весь код в этом модуле (до инструкции require), прежде чем искать следующий модуль. Это означает, что переменная будет иметь значение при переходе к определению модулей.</p>\n<p>Но с <em>ES</em>-модулями вы заранее строите весь этот граф модулей, прежде чем выполнять какую-либо оценку. Это означает, что вы не можете использовать переменные в своих спецификаторах модулей, поскольку эти переменные еще не имеют значений.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*K3yz98H3yo7-hUQy.png\"></p>\n<p>Но иногда очень полезно использовать переменные для путей модулей. Например, может потребоваться переключить загружаемый модуль в зависимости от того, что делает код или в какой среде он выполняется.</p>\n<p>Чтобы сделать это возможным для ES модулей, есть <a href=\"https://github.com/tc39/proposal-dynamic-import\">предложение под названием динамический импорт</a>. С его помощью можно использовать импорт вида import(<code>${path}/foo.js</code>).</p>\n<p>Это работает так: любой файл, загруженный с помощью import(), обрабатывается как точка входа в отдельный граф. Динамически импортируемый модуль запускает новый граф, который обрабатывается отдельно.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*S2GpoP47Seyri8Rl.png\"></p>\n<p>Однако следует отметить, что любой модуль, который находится в обоих этих графах, будет совместно использовать экземпляр модуля. Это происходит потому, что загрузчик кэширует экземпляры модулей. Для каждого модуля в определенной глобальной области будет только один экземпляр модуля.</p>\n<p>Это уменьшает объём работы для движка. Например, это означает, что файл модуля будет извлечен только один раз, даже если несколько модулей зависят от него (это одна из причин для кэширования модулей. Мы увидим другой в разделе оценки.)</p>\n<p>Загрузчик управляет этим кэшем с помощью так называемой <a href=\"https://html.spec.whatwg.org/multipage/webappapis.html#module-map\">карты модулей</a>. Каждый глобальный модуль отслеживает свои модули в отдельной карте.</p>\n<p>Когда загрузчик получает <em>URL</em>, он помещает этот <em>URL</em> в карту модуля и отмечает, что он в настоящее время извлекает файл (fetching). Затем он отправит запрос и перейдет к следующему файлу.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*4TbPku1ve_TZfvm6.png\"></p>\n<p>Что произойдет, если другой модуль зависит от того же файла? Загрузчик будет искать каждый <em>URL</em> в карте модуля. Если он увидит там fetching, он просто перейдет к следующему <em>URL</em>.</p>\n<p>Но карта модуля не просто отслеживает, какие файлы извлекаются. Карта модуля также служит в качестве кэша для модулей, как мы увидим далее.</p>\n<h3>Парсинг</h3>\n<p>Теперь, когда мы извлекли этот файл, нам нужно распарсить его в записи модуля. Это помогает браузеру понять, что представляют собой различные части модуля.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*AsoeAIGI6G4M6k45.png\"></p>\n<p>После создания запись модуля помещается в карту модуля. Это означает, что всякий раз, когда он запрашивается, загрузчик может вытащить его из этой карты.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*iMcuLbe97XMGIvnz.png\"></p>\n<p>Есть одна деталь в парсинге, которая может показаться тривиальной, но на самом деле имеет довольно большие последствия. Все модули анализируются так, как если бы они имели use strict вверху. Есть и другие незначительные отличия. Например, ключевое слово await зарезервировано в коде верхнего уровня модуля, а значение this — undefined.</p>\n<p>Другой способ парсинга называется целью парсинга <em>(parse goal)</em>. Если вы анализируете один и тот же файл, но используете разные цели, вы получите разные результаты. Таким образом, вы хотите знать, прежде чем начать парсинг, какой файл вы анализируете — является ли он модулем или нет.</p>\n<p>В браузерах это довольно легко. Вы просто добавляетеtype=\"module\" в тег <script>. Это говорит браузеру, что этот файл должен быть проанализирован как модуль. И поскольку импортировать можно только модули, браузер знает, что любой импорт также является модулем.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*7XWgICjSxgidpl49.png\"></p>\n<p>Но в <em>Node.js</em> вы не можете использовать <em>HTML</em>-теги, поэтому у вас нет возможности использовать атрибут type. Сообщество пыталось решить эту проблему с помощью расширения .mjs. Это расширение говорит <em>Node.js</em> что этот файл является модулем. Сообщество говорит об этом, как о метке для цели парсинга. Обсуждение в настоящее время продолжается, поэтому неясно, какую метку сообщество решит использовать в конце.</p>\n<p>В любом случае загрузчик определит, следует ли анализировать файл как модуль или нет. Если это модуль и есть импорт, он начнет процесс снова, пока все файлы не будут извлечены и распарсены.</p>\n<p>И все готово! По окончании процесса загрузки вы перешли от простого файла точки входа к множеству записей модуля.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*-efsKcPdNwE-2Fxt.png\"></p>\n<p>Следующий шаг — создать экземпляр этого модуля и связать Все экземпляры вместе.</p>\n<h3>Cоздание экземпляра</h3>\n<p>Последний шаг — заполнение этих ячеек памяти. <em>JS</em>-движок делает это, выполняя код верхнего уровня — код, который находится вне функций.</p>\n<p>Помимо простого заполнения этих ячеек памяти, оценка кода также может вызывать различные сайд-эффекты. Например, модуль может сделать запрос на сервер.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*uJuK9ryDnfphW7Bd.png\"></p>\n<p>Из-за потенциальных побочных эффектов вы хотите только один раз оценить модуль. В отличие от линковки, которая происходит при создании экземпляра, которая может выполняться несколько раз с точно таким же результатом, оценка может иметь разные результаты в зависимости от того, сколько раз вы это делаете.</p>\n<p>Это одна из причин наличия карты модулей. Карта модуля кэширует модуль по каноническому <em>URL</em>, так что для каждого модуля имеется только одна запись модуля. Это гарантирует, что каждый модуль выполняется только один раз.</p>\n<p>А как насчет тех циклов, о которых мы говорили раньше?</p>\n<p>В циклической зависимости вы в конечном итоге получаете цикл в графе. Обычно это длинная петля. Но чтобы объяснить проблему, я буду использовать пример с коротким циклом.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*dOyMkZxUV-Q0IoDD.png\"></p>\n<p>Давайте посмотрим, как это будет работать с модулями <em>CommonJS</em>. Во-первых, основной модуль выполнит оператор require. Затем будет загружен модуль counter.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*lCyyZPfmk8PRgwwE.png\"></p>\n<p>Модуль counter попытается получить доступ к message из объекта exports. Но так как он еще не был оценен в основном модуле, вернется undefined. <em>JS</em>-движок выделит пространство в памяти для локальной переменной и установит значение undefined.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*734NMB_qv35W4wdg.png\"></p>\n<p>Оценка продолжается до конца кода верхнего уровня counter. Мы хотим узнать, получим ли мы правильное значение для сообщения в конце концов (после оценки main.js), поэтому мы настроим таймаут. Затем оценка возобновляется на main.js.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*sFM37GwyjYbHU5NP.png\"></p>\n<p>Переменная message будет инициализирована и добавлена в память. Но поскольку между ними нет никакой связи, она останется неопределенной в требуемом модуле.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/0*xXkftHxJ7AxozuyF.png\"></p>\n<p>Если экспорт будет обработан с использованием привязок в реальном времени, в конце концов counter увидит правильное значение. К моменту истечения таймаута оценка main.js завершиться и в переменную присвоится значение.</p>\n<p>Поддержка этих циклов является большим основанием для разработки <em>ES</em>-модулей. Именно эта трехфазная архитектура и сделает её возможной.</p>\n<h3>Каков текущий статус ES-модулей ?</h3>\n<p>С выходом <em>Firefox 60</em> в начале мая, все основные браузеры будут поддерживать <em>ES</em>-модули по умолчанию. <em>Node.js</em> также добавляет поддержку, создана рабочая группа, занимающаяся выяснением проблем совместимости между <em>CommonJS</em> и <em>ES</em>-модулями.</p>\n<p>Это означает, что вы сможете использовать тег <script type=\"module\">, import и export. Однако еще больше возможностей впереди. <a href=\"https://github.com/tc39/proposal-dynamic-import\">*Dynamic imports proposal</a>* находится на <em>Stage 3</em> в процессе спецификации, также есть <a href=\"https://github.com/tc39/proposal-import-meta\">*import.meta</a><em>, а [</em>module resolution proposal](<a href=\"https://github.com/domenic/package-name-maps\">https://github.com/domenic/package-name-maps</a>)* поможет сгладить различия между браузерами и <em>Node.js</em>. Поэтому работа с модулями станет еще лучше в будущем.</p>\n<h2>Благодарность</h2>\n<p>Спасибо всем, кто дал обратную связь на этот пост, или чьи письма или дискуссии прошлого года, в том числе Акселю Раухшмаеру, Бредли Фариасу, Дейву Хернану, Доменику Дениколе, Хави Хоффману, Джейсону Везерсби, Джей-Эф Бастьену, Йону Копперду, Люку Вагнеру, Майлсу Боринсу, Тиллю Шнайдериту, Тобаясу Копперсу, Йехуде Кацу, участникам сообщества WebAssembly, Рабочей группе <em>Node Modules</em>, а также <em>TC39</em>.</p>\n<p><em>Перевод <a href=\"https://medium.com/@nzvtrkk\">Артура Храброва</a>, редактура <a href=\"https://medium.com/@pepelsbey\">Вадима Макеева</a>.</em></p>","frontmatter":{"title":"Глубокое погружение в ES-модули в картинках","date":"TODO"}}},"pageContext":{"slug":"/articles/es-modules-cartoon-dive/"}}