{"data":{"site":{"siteMetadata":{"title":"Веб-стандарты"}},"markdownRemark":{"id":"7a813d4d-b9cc-5b57-a8b1-8cffd4eeaf17","excerpt":"Руководство для прохождения интервью по фронтенду Перевод «Front End Interview Handbook» Юн Хен Тая. Часть 1. HTML Картинка  yangheng Что…","html":"<h1>Руководство для прохождения интервью по фронтенду</h1>\n<p>Перевод «Front End Interview Handbook» Юн Хен Тая.</p>\n<h2>Часть 1. HTML</h2>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/1*96ndS1Dh7zvkCKqv2avcWA.png\" alt=\"[Картинка ](https://dribbble.com/shots/3831443-Tech-Interview-Handbook)[yangheng](https://dribbble.com/yangheng)\"><em><a href=\"https://dribbble.com/shots/3831443-Tech-Interview-Handbook\">Картинка </a><a href=\"https://dribbble.com/yangheng\">yangheng</a></em></p>\n<h2>Что это такое?</h2>\n<p>В отличие от типичного собеседования с разработчиками ПО, на собеседованиях фронтенд-разработчиков меньше внимания уделяется алгоритмам. Большая часть вопросов касается специфичных знаний и компетенций в таких областях, как <em>HTML, CSS, JavaScript</em>.</p>\n<p>Несмотря на то, что существуют ресурсы, призванные помочь в подготовке к собеседованию, они сильно отличаются по полноте материалов от тех же ресурсов для разработчиков ПО. Среди того, что существует на сегодняшний день, наиболее полезным может быть сборник вопросов <a href=\"https://github.com/h5bp/Front-end-Developer-Interview-Questions\">*Front-end Developer Interview Questions</a>*. К сожалению, на многие вопросы я не смог найти в сети полные и удовлетворяющие ответы. Поэтому в документе ниже я постарался самостоятельно ответить на них. Будучи <a href=\"https://github.com/yangshun/front-end-interview-handbook\">открытым репозиторием</a>, этот проект может жить и развиваться благодаря сообществу, поскольку интернет эволюционирует.</p>\n<h2>Нужна более общая подготовка?</h2>\n<p>Вас может заинтересовать <a href=\"https://github.com/yangshun/tech-interview-handbook\">*Tech Interview Handbook</a><em>, в котором содержится информация для прохождения общих технических интервью, в частности описаны алгоритмы, даны ответы на вопросы по софт-скиллс. Также есть [</em>Interview Cheatsheet](<a href=\"https://github.com/yangshun/tech-interview-handbook/blob/master/preparing/cheatsheet.md\">https://github.com/yangshun/tech-interview-handbook/blob/master/preparing/cheatsheet.md</a>)*!</p>\n<h2>Вопросы по HTML</h2>\n<p>Ответы на вопросы из списка <a href=\"https://github.com/h5bp/Front-end-Developer-Interview-Questions#html-questions\">*Front-end Job Interview Questions — HTML Questions</a>*. Комментарии с предложениями по улучшению и дополнению приветствуются!</p>\n<h3>Что делает DOCTYPE?</h3>\n<!DOCTYPE> — это сокращение от «*document type*» (тип документа). Он объявляется в HTML для того, чтобы различать стандартный режим или [режим совместимости (*quirks mode*)](https://quirks.spec.whatwg.org/#history). Его наличие говорит браузеру работать со страницей в стандартном режиме.\n<p>Мораль истории — просто добавляй <!DOCTYPE html> в начало страницы.</p>\n<h3><strong>Ссылки</strong></h3>\n<ul>\n<li>\n<p><a href=\"https://stackoverflow.com/questions/7695044/what-does-doctype-html-do\">Stack Overflow: What does <!doctype html> do?</a></p>\n</li>\n<li>\n<p><a href=\"https://www.w3.org/QA/Tips/Doctype\">W3C: Don’t forget to add a doctype.</a></p>\n</li>\n<li>\n<p><a href=\"https://quirks.spec.whatwg.org/#history\">Quirks Mode: History.</a></p>\n</li>\n</ul>\n<h3>Как поддерживать страницу на нескольких языках?</h3>\n<p>Вопрос немного расплывчатый. Полагаю, что речь о наиболее частом случае: как поддерживать страницу с содержимым на нескольких языках, где одновременно должен отображаться только один язык.</p>\n<p>Когда к серверу делается <em>HTTP</em>-запрос, то браузер пользователя обычно отсылает информацию о предпочитаемом языке в заголовке Accept-Language. Сервер может использовать эту информацию, чтобы вернуть версию документа на подходящем языке, если такая возможность есть. В возвращенном <em>HTML</em>-документе обязательно должен быть указан атрибут lang у тега <html>, к примеру <html lang=\"en\">.</p>\n<p>На бэкенде <em>HTML</em>-разметка будет содержать плейсхолдер i18n, а контент для конкретного языка будет хранится в <em>YML-</em> или <em>JSON-</em>формате. Сервер динамически формирует <em>HTML</em>-страницу с контентом на конкретном языке, чаще всего при помощи бэкенд-фреймворка.</p>\n<h3><strong>Ссылки</strong></h3>\n<ul>\n<li><a href=\"https://www.w3.org/International/getting-started/language\">W3C: Language on the Web</a>.</li>\n</ul>\n<h3>На что обратить внимание при разработке мультиязычных сайтов?</h3>\n<ul>\n<li>\n<p><strong>Используй атрибут lang в <em>HTML</em>.</strong></p>\n</li>\n<li>\n<p>**Перенаправляй пользователей на версию сайта на их языке. **Позволяйте быстро и без проблем изменить страну и язык.</p>\n</li>\n<li>\n<p><strong>Текст на картинках плохо поддается адаптации.</strong> Многие до сих пор помещают текст на картинки чтобы получить хорошо выглядящий несистемный шрифт на любом компьютере. Однако чтобы перевести текст картинкой, нужно иметь подготовленную картинку с каждой строкой текста для каждого языка. При большом количестве текста это быстро выйдет из под контроля.</p>\n</li>\n<li>\n<p><strong>Ограничение длины слов и предложений.</strong> Некоторый контент может быть длиннее при написании на другом языке. Будьте внимательны к макету и проверяйте поведение блоков при переполнении. Количество символов важно в таких элементах, как заголовки, лейблы и кнопки. Но не так важно в основном тексте или в блоке комментария.</p>\n</li>\n<li>\n<p><strong>Помните о восприятии цветов.</strong> В разных языках и культурах цвета имеют разное значение. Дизайн должен учитывать эти особенности.</p>\n</li>\n<li>\n<p><strong>Форматируете даты и валюты.</strong> Календарные даты иногда пишутся по-разному. Например, «Май 31, 2012» в Америке или «31 мая 2012» в большинстве стран Европы.</p>\n</li>\n<li>\n<p><strong>Не склеивайте переведенные строки.</strong> Не пишите что-то вроде \"Сегодняшняя дата \" + date. Эта фраза будет выглядеть коряво на языках с другим порядком слов. Вместо этого используйте параметры шаблона.</p>\n</li>\n<li>\n<p><strong>Разные направления чтения.</strong> В русском мы читаем слева направо, сверху вниз. В традиционном японском языке текст читается сверху вниз, справа налево.</p>\n</li>\n</ul>\n<h3><strong>Ссылки</strong></h3>\n<ul>\n<li><a href=\"https://www.quora.com/What-kind-of-things-one-should-be-wary-of-when-designing-or-developing-for-multilingual-sites\">What kind of things one should be wary of when designing or developing for multilingual sites?</a></li>\n</ul>\n<h3>Для чего отлично подойдут data-атрибуты?</h3>\n<p>До того, как <em>JavaScript</em>-фреймворки стали популярны, фронтенд-разработчики использовали data-атрибуты чтобы хранить дополнительные данные прямо в <em>DOM</em> без хаков вроде нестандартных атрибутов или дополнительных свойств в <em>DOM</em>. Атрибуты этого семейства предназначены для хранения частных данных пользователя, для которых не существует более подходящих атрибутов или элементов, на странице или в приложении.</p>\n<p>На сегодняшний день использование data-атрибутов не поощряется. Одной из причин является то, что пользователь может модифицировать данные в атрибуте, используя инспектор кода в браузере. Данные лучше хранить в самом JavaScript и обновлять DOM при помощи связывания данных через библиотеку или фреймворк.</p>\n<h3><strong>Ссылки</strong></h3>\n<ul>\n<li>\n<p><a href=\"http://html5doctor.com/html5-custom-data-attributes/\">HTML5 Custom Data Attributes (data-*)</a>.</p>\n</li>\n<li>\n<p><a href=\"https://www.w3.org/TR/html5/dom.html#embedding-custom-non-visible-data-with-the-data-attributes\">HTML 5.2: Embedding custom non-visible data with the data-* attributes</a></p>\n</li>\n</ul>\n<h3>Представьте HTML5 как открытую веб-платформу. Из каких блоков состоит HTML5?</h3>\n<ol>\n<li>\n<p><strong>Семантика.</strong> Позволяет более точно описать из чего состоит контент.</p>\n</li>\n<li>\n<p><strong>Связанность.</strong> Позволяет общаться с сервером новыми и инновационными способами.</p>\n</li>\n<li>\n<p><strong>Офлайн и хранилище.</strong> Позволяют страницам хранить данные локально на клиентской стороне и более эффективно работать в офлайне.</p>\n</li>\n<li>\n<p><strong>Мультимедиа.</strong> Ставит создание видео и аудио на первое место в вебе.</p>\n</li>\n<li>\n<p><strong>2D- и 3D-графика и эффекты.</strong> Позволяет расширить возможности презентации.</p>\n</li>\n<li>\n<p><strong>Производительность и интеграция.</strong> Обеспечивает большую скорость оптимизации и лучшее использование аппаратных средств.</p>\n</li>\n<li>\n<p><strong>Доступ к устройствам.</strong> Позволяет взаимодействовать с различными устройствами ввода и вывода.</p>\n</li>\n<li>\n<p><strong>Стилизация.</strong> Позволяет создавать более сложные темы оформления.</p>\n</li>\n</ol>\n<h3><strong>Ссылки</strong></h3>\n<ul>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/HTML5\">MDN: HTML5</a>.</li>\n</ul>\n<h3>Объясните разницу между cookie, sessionStorage и localStorage.</h3>\n<p>Все вышеупомянутые технологии являются механизмами хранения типа ключ-значение на клиентской стороне. Они могут хранить данные только как строки.</p>\n<h3>Cookie</h3>\n<ul>\n<li>\n<p><strong>Инициатор:</strong> клиент или сервер. Сервер может использовать заголовок Set-Cookie.</p>\n</li>\n<li>\n<p><strong>Срок хранения:</strong> устанавливается вручную.</p>\n</li>\n<li>\n<p><strong>Хранение между сессиями:</strong> зависит от установки срока хранения.</p>\n</li>\n<li>\n<p><strong>Связь с доменом:</strong> да.</p>\n</li>\n<li>\n<p><strong>Отправка на сервер с каждым <em>HTTP</em>-запросом:</strong> автоматически, с помощью заголовка Cookie.</p>\n</li>\n<li>\n<p><strong>Емкость, на один домен:</strong> 4 КБ.</p>\n</li>\n<li>\n<p><strong>Доступность:</strong> в любом окне.</p>\n</li>\n</ul>\n<h3>Local Storage</h3>\n<ul>\n<li>\n<p><strong>Инициатор:</strong> клиент.</p>\n</li>\n<li>\n<p><strong>Срок хранения:</strong> всегда.</p>\n</li>\n<li>\n<p><strong>Хранение между сессиями:</strong> да.</p>\n</li>\n<li>\n<p><strong>Связь с доменом:</strong> нет.</p>\n</li>\n<li>\n<p><strong>Отправка на сервер с каждым <em>HTTP</em>-запросом:</strong> нет.</p>\n</li>\n<li>\n<p><strong>Емкость, на один домен:</strong> 5 МБ.</p>\n</li>\n<li>\n<p><strong>Доступность:</strong> в любом окне.</p>\n</li>\n</ul>\n<h3>Session Storage</h3>\n<ul>\n<li>\n<p><strong>Инициатор:</strong> клиент.</p>\n</li>\n<li>\n<p><strong>Срок хранения:</strong> до закрытия вкладки.</p>\n</li>\n<li>\n<p><strong>Хранение между сессиями:</strong> нет.</p>\n</li>\n<li>\n<p><strong>Связь с доменом:</strong> нет.</p>\n</li>\n<li>\n<p><strong>Отправка на сервер с каждым <em>HTTP</em>-запросом:</strong> нет.</p>\n</li>\n<li>\n<p><strong>Емкость, на один домен:</strong> 5 МБ.</p>\n</li>\n<li>\n<p><strong>Доступность:</strong> в той же вкладке.</p>\n</li>\n</ul>\n<h3><strong>Ссылки</strong></h3>\n<ul>\n<li>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Cookies\">https://developer.mozilla.org/en-US/docs/Web/HTTP/Cookies</a></p>\n</li>\n<li>\n<p><a href=\"http://tutorial.techaltum.com/local-and-session-storage.html\">http://tutorial.techaltum.com/local-and-session-storage.html</a></p>\n</li>\n</ul>\n<h3>Разница между <script>, <script async> и <script defer></h3>\n<ul>\n<li>\n<script> — отрисовка *HTML* блокируется, скрипт извлекается и выполняется немедленно, отрисовка *HTML* возобновляется после окончания выполнения скрипта.\n\n</li>\n<li>\n<script async> — скрипт будет извлечен и обработан параллельно с отрисовкой *HTML*, его выполнение закончится как только это будет возможно (обычно до того, как закончилась отрисовка *HTML*). Используйте async тогда, когда скрипт не зависит от других скриптов на странице, например для аналитики.\n\n</li>\n<li>\n<script defer> — скрипт будет извлечен параллельно с отрисовкой HTML, его выполнение произойдет после того, как вся страница будет загружена. Если таких скриптов несколько, то каждый из них будет исполнятся в том порядке, в котором они расположены в документе. Если скрипту нужен полностью распарсеный DOM, то атрибут defer обеспечит уверенность в том, что на момент отработки скрипта весь *HTML* отрисован. Нет особой разницы со скриптами, расположенными перед тегом <body>. Отложенный скрипт не должен содержать document.write.\n</li>\n</ul>\n<p><em>Примечание</em>: Атрибуты async и defer игнорируются, если у тега <script> нет атрибута src.</p>\n<p><strong>Ссылки</strong></p>\n<ul>\n<li>\n<p><a href=\"http://www.growingwiththeweb.com/2014/02/async-vs-defer-attributes.html\">async vs defer attributes</a>.</p>\n</li>\n<li>\n<p><a href=\"https://stackoverflow.com/questions/10808109/script-tag-async-defer\">Stack Overflow: Script Tag — async &#x26; defer</a>.</p>\n</li>\n<li>\n<p><a href=\"https://bitsofco.de/async-vs-defer/\">Asynchronous vs Deferred JavaScript</a>.</p>\n</li>\n</ul>\n<h3>Почему хорошей практикой считается располагать <link> для подключения CSS между <head></head>, а <script> для подключения JS ставить перед </body>? Знаете ли вы исключения?</h3>\n<h3><strong>Размещение <link> внутри <head></strong></h3>\n<p>Необходимость помещать теги <link> внутри шапки сайта описана в спецификации. Кроме того, размещение в верхней части разметки позволяет загружать страницу постепенно, что хорошо отражается на опыте использования. Проблема, возникающая при размещении таблиц стилей в нижней части страницы, заключается в том, что этот порядок препятствует прогрессивной загрузке страницы во многих браузерах. В том числе в <em>Internet Explorer</em>. Некоторые браузеры блокируют загрузку страницы, чтобы избежать перерисовки элемента, если его стили изменятся. Все это время пользователь будет пялиться на белый экран. Такое поведение браузеров предотвращает мерцание или отрисовку нестилизованых элементов.</p>\n<h3><strong><em>Размещение <script> прямо перед </body></em></strong></h3>\n<p>Теги <script> блокируют отрисовку <em>HTML</em> на то время, пока они скачиваются и исполняются. Скачивание скриптов в конце позволяет сперва распарсить и показать пользователю весь <em>HTML</em>.</p>\n<p>Исключением является случай, когда в вашем скрипте содержится document.write(). Но на сегодняшний день его использование не считается хорошей практикой. К тому же, расположение скриптов внизу разметки означает, что браузер не может начать их скачивать до тех пор, пока не отрисован весь документ. Единственным рабочим способом, при котором <script> будет расположен внутри <head>, является добавление атрибута defer.</p>\n<h3><strong>Ссылки</strong></h3>\n<ul>\n<li><a href=\"https://developer.yahoo.com/performance/rules.html#css_top\">Yahoo: Put Stylesheets at the Top</a>.</li>\n</ul>\n<h3>Что такое прогрессивный рендеринг?</h3>\n<p>Прогрессивный рендеринг — имя, данное технологиям, используемым для ускорения отрисовки страниц (в частности, уменьшение времени загрузки), чтобы показать пользователю контент как можно скорее.</p>\n<p>До того, как широкополосный интернет распространился повсеместно, прогрессивный рендеринг встречался довольно часто. Но этот подход по прежнему полезен в современной разработке, поскольку все более популярным (и ненадежным) становится мобильный доступ в интернет.</p>\n<p>Примеры технологий:</p>\n<ul>\n<li>\n<p><strong>Ленивая загрузка картинок.</strong> Картинки на странице не загружаются все разом. JavaScript подгрузит картинки тогда, когда пользователь доскроллит до той части страницы, на которой они расположены.</p>\n</li>\n<li>\n<p>**Приоритизация видимого контента. **Только минимум CSS, контента, скриптов, необходимых для отрисовки той части страницы, которую пользователь увидит первой. Вы можете использовать отложенные скрипты или слушать события DOMContentLoaded или load, чтобы загрузить остальные ресурсы и контент.</p>\n</li>\n<li>\n<p>**Асинхронные фрагменты HTML. *<em>Отправка в браузер частей *HTML</em>-страницы, созданной на бэкенде. Более подробно про эту технологию можно почитать <a href=\"http://www.ebaytechblog.com/2014/12/08/async-fragments-rediscovering-progressive-html-rendering-with-marko/\">в этой статье</a>.</p>\n</li>\n</ul>\n<h3><strong>Ссылки</strong></h3>\n<ul>\n<li>\n<p><a href=\"https://stackoverflow.com/questions/33651166/what-is-progressive-rendering\">Stack Overflow: What is progressive rendering?</a></p>\n</li>\n<li>\n<p><a href=\"http://www.ebaytechblog.com/2014/12/08/async-fragments-rediscovering-progressive-html-rendering-with-marko/\">Async Fragments: Rediscovering Progressive HTML Rendering with Marko</a>.</p>\n</li>\n</ul>\n<h3>Приходилось ли вам работать с языками HTML-шаблонизации?</h3>\n<p>Да, <em>Pug</em> (ранее известный как <em>Jade</em>), <em>ERB, Slim, Handlebars, Jinja, Liquid</em> и это только некоторые из них. По моему мнению, все они более или менее одинаковые и предоставляют одинаковые возможности экранирования контента и полезных фильтров для работы с отображаемыми данными. Большинство движков позволяют вводить собственные фильтры, если вам требуется дополнительная обработка контента перед его отображением.</p>\n<h2>Другие ответы</h2>\n<ul>\n<li>\n<p><a href=\"https://neal.codes/blog/front-end-interview-questions-html/\">Front End Interview Questions HTML</a>.</p>\n</li>\n<li>\n<p><a href=\"http://peterdoes.it/2015/12/03/a-personal-exercise-front-end-job-interview-questions-and-my-answers-all/\">The Definitive “Front-End Developer Job Interview Questions” And My Answers</a>.</p>\n</li>\n</ul>\n<p><em>Перевод <a href=\"https://medium.com/@ABatickaya\">Алёны Батицкой</a>, редактура <a href=\"https://medium.com/@pepelsbey\">Вадима Макеева</a>.</em></p>","frontmatter":{"title":"Руководство для прохождения интервью по фронтенду","date":"TODO"}}},"pageContext":{"slug":"/articles/front-end-interview-handbook/"}}